## Production: alarms
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 1 to change, 0 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.twoFa_verification_exceeded will be created
  + resource "aws_cloudwatch_log_metric_filter" "twoFa_verification_exceeded" {
      + id             = (known after apply)
      + log_group_name = "Forms"
      + name           = "2FAVerificationExceeded"
      + pattern        = "\"2FA Lockout: Verification code attempts exceeded\""

      + metric_transformation {
          + default_value = "0"
          + name          = "2FAVerificationExceeded"
          + namespace     = "forms"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.cognito_signin_exceeded will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "cognito_signin_exceeded" {
        id                        = "CognitoSigninExceeded"
        tags                      = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
      ~ threshold                 = 10 -> 5
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.twoFa_verification_exceeded will be created
  + resource "aws_cloudwatch_metric_alarm" "twoFa_verification_exceeded" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:957818836222:alert-warning",
        ]
      + alarm_description                     = "2FA - multiple failed verification attempts detected. User has been locked out (see audit logs)."
      + alarm_name                            = "2FAVerificationExceeded"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "2FAVerificationExceeded"
      + namespace                             = "forms"
      + period                                = 60
      + statistic                             = "Sum"
      + tags                                  = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + threshold                             = 2
      + treat_missing_data                    = "notBreaching"
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_versioning resource instead

(and 8 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.route53_ddos"]

19 tests, 17 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
